app/views/books/index.html.haml

SELECT "books".* FROM "books" WHERE "books"."user_id" = 1 ORDER BY updated_at DESC
SELECT COUNT(*) FROM "books" INNER JOIN "watchings" ON "books".id = "watchings".book_id WHERE (("watchings".user_id = 1))
---

- if @user.books.count > 0

SELECT "titles".* FROM "titles" WHERE "titles"."id" = 1 LIMIT 1
SELECT * FROM "authors" INNER JOIN "authors_titles" ON "authors".id = "authors_titles".author_id WHERE ("authors_titles".title_id = 1 ) LIMIT 1
---
          %br
          = link_to book.title.authors.first.name, author_path(book.title.authors.first)