app/controllers/admin_controller.rb

  def stats
    @users = User.count
    @books = Title.count
    @loans = Loan.count
    @current_loans = Loan.where(returned: :nil).count
    @watchings = Watching.count
---
SELECT COUNT(*) FROM "users"
SELECT COUNT(*) FROM "titles"
SELECT COUNT(*) FROM "loans"
SELECT COUNT(*) FROM "loans" WHERE ("loans".borrower_id = 1 AND ("loans"."returned" IS NULL))
SELECT COUNT(*) FROM "watchings"