app/controllers/books_controller.rb

  def index
    @books = Book.find_all_by_user_id(current_user.id, :order => 'updated_at DESC')
---
SELECT "books".* FROM "books" WHERE "books"."user_id" = 1 ORDER BY updated_at DESC

  def show
    @book = Book.find(params[:id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = 1 LIMIT 1

  def create
    begin
      if @title = Title.find_or_create_by_isbn13(params[:isbn13])

        @book = Book.create(
          :title => @title,
          :user => current_user,
          :status => StaticData::BOOK_STATUS['AVAILABLE']
        )
---
INSERT INTO "titles" ("isbn13", "title", "subtitle", "description", "image_url", "created_at", "updated_at") VALUES ('9782894502556', 'Caillou Play with Me', NULL, 'Caillou wants to play with his father, but Daddy has to go to work, so he must wait until the weekend to be able to play with him.', 'http://books.google.es/books/content?id=FlbzJL7PjIYC&printsec=frontcover&img=1&zoom=5&source=gbs_api', '2016-02-13 21:26:19.963394', '2016-02-13 21:26:19.963394')
SELECT "titles".* FROM "titles" WHERE "titles"."isbn13" = '978548754' LIMIT 1
INSERT INTO "books" ("title_id", "user_id", "created_at", "updated_at", "status") VALUES (1, 1, '2016-03-03 21:47:31.247918', '2016-03-03 21:47:31.247918', 0)