app/controllers/password_resets_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'carlos@prueba.es' LIMIT 1
---
  def create
    @user = User.find_by_email(params[:email])

UPDATE "users" SET "password_salt" = 'HfQO1fnt9P64KiBISnI', "crypted_password" = 'efbb07a914cdc7cebf4c1c5c9d7916e120e3ee46fa9b2c27280add0fdeb77a864c01c661b4f0c9027ff06556a26077014fd4ed91d52220802faae367f07c4679', "persistence_token" = '871364715c326b97ea1418b3d71d0856bf7ef15ae1dd62ae796c44f88845dde115de2a4f489da92fec18607af560600ed90736076371687efc0279a16d7fbb15', "perishable_token" = 'aybBk5AwytgPpKcDuwSj', "login_count" = 2, "last_login_at" = '2016-02-13 21:15:05.678630', "current_login_at" = '2016-02-28 18:10:12.062848', "last_login_ip" = '127.0.0.1', "last_request_at" = '2016-02-28 18:10:12.063304', "updated_at" = '2016-02-28 18:10:12.063782' WHERE "users"."id" = 1
---
  def update
    @user.password = params[:user][:password]
    @user.password_confirmation = params[:user][:password_confirmation]
    if @user.save

SELECT  "users".* FROM "users" WHERE (perishable_token = 'v3MQCwWjdFk9YgIUv6I' and updated_at > '2016-03-22 09:30:07.194614')  ORDER BY "users"."id" ASC LIMIT 1
---
  def load_user_using_perishable_token
    @user = User.find_using_perishable_token(params[:id])