app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at", "login", "email", "crypted_password", "password_salt", "persistence_token", "single_access_token", "perishable_token", "login_count", "failed_login_count", "last_request_at", "current_login_at", "last_login_at", "current_login_ip", "last_login_ip", "first_name", "last_name", "address1", "address2", "city", "county", "postcode", "phone", "status", "banned") VALUES ('2016-02-06 23:56:40.215714', '2016-02-06 23:56:40.215714', 'carlos', 'carlos@prueba.es', '4ddfab244ecece7f6c3fbee991fb6b5c7abb32c47ed3df82271b468f5bef38f301eac75ab780f9bd0548ed911a22f307b0c3655948589309a114bbb3c1dd3723', 'oDmAsp6tKNecY53EizZQ', '80b0c474fe103fee7326ff0ae974012991ea5c207a9c2e009306a89d4280e72a7eca0a071905a56f5616486e5acf6cfd3960e138edb78aa97e1ca07cc368d7aa', 'uJ3dPZjV13X83DcCPQg', 'axeAcO3mOvsNDosYBfQ', 1, 0, '2016-02-06 23:56:40.214950', '2016-02-06 23:56:40.214419', NULL, '127.0.0.1', NULL, 'Carlos', 'Carlos', 'Carlos', '', 'Carlos', '', '28012', '', 'user', 'f')
---
  def create
    @user = User.new(params[:user])

    @user.status = 'user'
    @user.banned = false

    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def show
    @user = User.find(params[:id])

SELECT "watchings".* FROM "watchings" WHERE "watchings"."user_id" = 1 ORDER BY created_at DESC
---
  def watched_books
    @watchings = Watching.where(user_id: current_user).order(created_at: :desc)