app/views/members/show.html.haml

      %td
        = pluralize(@user.books.count, "book")
---
SELECT COUNT(*) FROM "books" INNER JOIN "watchings" ON "books".id = "watchings".book_id WHERE (("watchings".user_id = 1))

      %td
        = pluralize(@user.loans.count, "book")
---
SELECT COUNT(*) FROM "loans" WHERE ("loans".borrower_id = 1)